%我们取 n = 20, 200, 2000三个量级
%取 a = 0.1, k/sqrt(sqrt(n/2)), 5三种不同的取值方式，其中k需要根据不同的窗函数选择合适的值
clear all;
%方窗函数, k = 5.6
Num = [20,200,2000];
a(1,:) = [0.1 5.6/sqrt(sqrt(10)) 5]';
a(2,:) = [0.1 5.6/sqrt(sqrt(100)) 5]';
a(3,:) = [0.1 5.6/sqrt(sqrt(1000)) 5]';
for i=1:3
    Parzen(Num(i), a(i,:),0.5,1,1,3,4,i);
end

%方窗函数, k = 14
Num = [20,200,2000];
a(1,:) = [0.1 14/sqrt(sqrt(10)) 5]';
a(2,:) = [0.1 14/sqrt(sqrt(100)) 5]';
a(3,:) = [0.1 14/sqrt(sqrt(1000)) 5]';
for i=1:3
    Parzen(Num(i), a(i,:),0.5,2,1,3,4,i);
end