%我们取 n = 10, 100, 1000三个量级
%取 a = 0.1, k/sqrt(n), 5三种不同的取值方式，其中k需要根据不同的窗函数选择合适的值
clear all;
%方窗函数, k = 30
Num = [10,100,1000];
a(:,1) = [0.1 30/sqrt(10) 5]';
a(:,2) = [0.1 30/sqrt(100) 5]';
a(:,3) = [0.1 30/sqrt(1000) 5]';
figure();
for i = 1:3
    for j = 1:3
        Parzen(Num(i), a(j,i),0.01,1,1,3,3,3*i+j-3);
    end
end

%正态窗函数, k = 95
Num = [10,100,1000];
a(:,1) = [0.1 95/sqrt(10) 5]';
a(:,2) = [0.1 95/sqrt(100) 5]';
a(:,3) = [0.1 95/sqrt(1000) 5]';
figure();
for i = 1:3
    for j = 1:3
        Parzen(Num(i), a(j,i),0.01,2,1,3,3,3*i+j-3);
    end
end

%三角窗函数, k = 63
Num = [10,100,1000];
a(:,1) = [0.1 63/sqrt(10) 5]';
a(:,2) = [0.1 63/sqrt(100) 5]';
a(:,3) = [0.1 63/sqrt(1000) 5]';
figure();
for i = 1:3
    for j = 1:3
        Parzen(Num(i), a(j,i),0.01,3,1,3,3,3*i+j-3);
    end
end

%二次窗函数, k = 32
Num = [10,100,1000];
a(:,1) = [0.1 32/sqrt(10) 5]';
a(:,2) = [0.1 32/sqrt(100) 5]';
a(:,3) = [0.1 32/sqrt(1000) 5]';
figure();
for i = 1:3
    for j = 1:3
        Parzen(Num(i), a(j,i),0.01,4,1,3,3,3*i+j-3);
    end
end